M5Fly-kanazawa/stampfly_ecosystem/firmware/controller/sdkconfig.defaults
# ESP32-S3 ターゲット設定 (M5Stack AtomS3)
CONFIG_IDF_TARGET="esp32s3"

# フラッシュサイズ (8MB)
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# パーティションテーブル
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# シリアルモニタ速度
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# FreeRTOS 設定
CONFIG_FREERTOS_HZ=1000

# WiFi 設定
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32

# ログレベル
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# C++ 例外サポート
CONFIG_COMPILER_CXX_EXCEPTIONS=y

# SPIFFS 設定
CONFIG_SPIFFS_MAX_PARTITIONS=3
